---
kind: type
id: T:Autodesk.Revit.DB.RenderingImageExposureSettings
source: html/94e2205c-ae49-e3a4-35e5-93d91f1bafb3.htm
---
# Autodesk.Revit.DB.RenderingImageExposureSettings

Represents the exposure settings of rendering.

## Syntax (C#)
```csharp
public class RenderingImageExposureSettings : IDisposable
```